<?
/* vim: set expandtab tabstop=4 shiftwidth=4 foldmethod=marker: */
/**
* ÀÛ¼ºÀÏ: 2009-07-25
* ÀÛ¼ºÀÚ: ±èÁ¾ÅÂ
* ¼³   ¸í: ºñ¼Ó¾î Â÷´Ü ¸ðµâ
*****************************************************************
* 
*/


	//2008-11-28 Çö¹Î ºÒ·®¾ÆÀÌµð, ¾ÆÀÌÇÇ Â÷´Ü Ãß°¡¿ä~
	$sql = "SELECT str_text, str_alert, str_chk FROM TAB_CROSSUSER WHERE NUM_OID=$_OID and STR_CHK='id' and STR_TEXT='".$_POST['str_user']."'";
	$row_cross = $DB->sqlFetch($sql);
	if($row_cross[str_text]){
	  $cross_msg = $row_cross[str_alert]."\n".$row_cross[str_chk]." : ".$row_cross[str_text];
      WebApp::moveBack($cross_msg);
	  exit;
	}
	

	$sql = "SELECT str_text, str_alert, str_chk FROM TAB_CROSSUSER WHERE NUM_OID=$_OID and STR_CHK='ip' and STR_TEXT='".$_SERVER["REMOTE_ADDR"]."'";
	$row_cross = $DB->sqlFetch($sql);
	if($row_cross[str_text]){
	  $cross_msg = $row_cross[str_alert]."\n".$row_cross[str_chk]." : ".$row_cross[str_text];
      WebApp::moveBack($cross_msg);
	  exit;
	}

if($str_text){
	$str_text = addslashes($str_text);
}else{
	$str_text = addslashes($_POST['content']);
}

//$str_text = htmlspecialchars($str_text);
//$str_text = preg_replace("/\<[ \/]*(script)(.*?)\>/i","",$str_text);		
//$title = preg_replace(,"",$title);

if(strstr($str_text, "/\<[ \/]*(script)(.*?)\>/i")) {
	//WebApp::moveBack('º»¹®Áß ½ºÅ©¸³Æ®°¡ Æ÷ÇÔµÅ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');
}

if(strstr($str_text ,"<script")) {
	WebApp::moveBack('º»¹®Áß ½ºÅ©¸³Æ®°¡ Æ÷ÇÔµÅ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');
}

if(strstr($str_text ,"<SCRIPT")) {
	WebApp::moveBack('º»¹®Áß ½ºÅ©¸³Æ®°¡ Æ÷ÇÔµÅ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');
}

if(strstr($_POST['str_title'] ,"<script")) {
	WebApp::moveBack('Á¦¸ñ¿¡ ½ºÅ©¸³Æ®°¡ Æ÷ÇÔµÅ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');
}

if(strstr($_POST['str_title'] ,"<SCRIPT")) {
	WebApp::moveBack('Á¦¸ñ¿¡ ½ºÅ©¸³Æ®°¡ Æ÷ÇÔµÅ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');
}

if(_BI_NO =="Y"){
// ÀÓ½Ã ±ÝÁö¾î Ã³¸®ÀÔ´Ï´Ù. //2007-11-07 Á¾ÅÂ
$backtext = "¹ÙµÏÀÌ|Æ÷Ä«|nara.cn|xgame|°í½ºÅé|¾¾¹ß|¹ÌÄ£|8¾ï|°³»õ³¢|¼Ò»õ³¢|º´½Å|Áö¶ö|¾¾ÆÈ|½ÊÆÈ|´Ï±â¹Ì|Âî¶ö|Áö¶ö|½Ö³â|½Ö³ð|ºù½Å|Á¿±î|´Ï±â¹Ì|Á¿°°Àº°Ô|Àâ³ð|º­¾û½Å|¹Ùº¸»õ³¢|¾Ã»õ³¢|¾¾¹ß|¾¾ÆÈ|½Ã¹ú|¾¾¹ú|¶°±×¶ö|Á¿¹ä|ÃßÃµÀÎ|ÃßÃµid|ÃßÃµ¾ÆÀÌµð|ÃßÃµid|ÃßÃµ¾ÆÀÌµð|Ãß/Ãµ/ÀÎ|½¦ÀÌ|µî½Å|½Î°¡Áö|¹ÌÄ£³ð|¹ÌÄ£³Ñ|Âî¶ö|Á×½À´Ï´Ù|´Ô¾Æ|´Ôµé¾Æ|¾¾¹ë³Ñ|°í½ºÅé|Æ÷Ä«|°£³ª»õ³¢|°£³ªœòÈ÷|°¥º¸³Ñ|°¥º¸³â|°¥º¸¶Ë³â|°¥º¸¶Ë³ð|°³³â¾Æ|°³³ð¾Æ|°³´¨¾Æ|°³´Æ½ÃÅ°|°³¶Ë½à´¤|°³¶Ë½à´Æ|°³¶Ë½à¿æ|°³¶Ë¾¾¾Ó³Ñ|°³¶Ë¾¾¾Ó³â|°³¶Ë¾¾¾Ó´¤|°³º¸Áö|°³ºÎ¶ö³â|°³ºÎ¶ö´¤|°³»Í¾Ë³Ñ|°³»Í¾Ë³â|°³»õ³¢¾ß|°³¼§|°³½à³ð|°³ÀÚÁö|°³ »µµ|°³Á½µÎ|°³¡µµ|°³È£·Î»õ³¢|°ÅÁö±ø²¤ÀÌ|°ÅÁö³¯¶ó¸®|°ÅÁö¶¯ÃÊ|°É·¡³â|°É·¡´¤|±¸³ç¿¡|±ú°¡Å÷½§È÷|±ú°¡Æ°»õ³¢|±ú°¡Æ°Àº|±ú°¥º¸³â|±ú°Å·¯Áö|±ú»õ³¢|´«±ò»Ì¾Æ¹ö·Á|´Ï¹Ì·²|´Ï»×|´×±â¹Ì|´ë°¡¸®µû¹ö·Á|´ë°¥ÅëºÎ¼Å|´ëÁú·¡|µØÁ®¾²|µØÁö°í|µØÁú¶ó|µðÁú·¡|µþµþÀÌ³ªÃÄ|¶°±×·²|¶Í¶ÍÀÌ|¶ì¹Ù»õ³¢|¶ì¹ß³ð|¶ð¶§³¢|¹®´óÀÌµû½­|¹®´óÀÌ»õ²î|¹®´óÀÌ½¦Å°|¹ÌÄ£°³»Á´Ù±¸|¹ð½®|¹ð½Å|º´µû|º´»ï°°Àº|º´½Å°³Àâ³â|º´½Å¶Ç¶óÀÌ»ðÁú|º´½Å¾ÖÀÚ|º´½ÅÀ°°©¶°³×|º¸ÁöÁ¶°¹»ì|ºã½Å°³Àâ³ð|ºã½Å°³Àâ´¤|ºé½Å°°Àº³â|ºé½Å°°Àº³ð|ºé½Å°°Àº´¤|ºù¶ì|ºù½®|ºù½Å°°Àº|ºü±¸¸®|ºü±¼|¼§³ð»õ³¢|¼§È£·Î|¼½½º³ªÇØ|¼öº§³ð|½§³¢|½¬¹ß³ð|½¬º¬¾Æ|½¬ºÒ³ð|½¬ÆÄ|½¬¾Ÿ|½±¾Ëšx³¢|½±ÆÈ³Ñ|½ºÆÅ»õ³¢|½Ã¹ãÄç|½Ã¹ú³Ñ|½Ãº§³ð|½Ã”U³ð|½Ãºí|½Ê»õ³¢|½Ê»õ¾ß|½Ê¼¼³¢|½Ê¾Ë³Ñ|½Ö°£³ª»õ³¢|½Ö³â|½Ö³ð|½Ö³ð»õ³¢|½ÖÁöŽú|½à³â|½à³ð|½á±Û³Ñ|½á±Û³â|œj°£³ª»õ³¢|œj°£³ª½§È÷|œj°Í|œj³â|œj»õ¸®|œj¼¼³¢|œj½¦³¢|¾¦ÅÊÀÚ½»|¾¦ÅÊÀÚ½Ä|¾¯º§³Ñ|¾¯ÆÈ´¤|d½¦|dÇÒ|¾²´ó¾Æ|¾²¹ë¾Æ|±¾Ë|¾¾´ó¾Æ|¾¾´óÀÌ|¾¾¹Ú|¾¾¹Û|¾¾¹ß|¾¾¹ß|¾¾¹à|¾¾¹á|¾¾¹æ»õ|¾¾¹ð»õ³¢|¾¾¹ð¾Æ|¾¾º¬»õ³¢|¾¾º¬¾Æ|¾¾º¬¾ß|¾¾ºÒ³â|¾¾ºØ|¾¾ºý|¾¾•¾|¾¾»Í»õ|¾¾ÆÈ|¾¾ÆÙ|¾ÃÅÊÀÌ|¾ÃÇÒ»õ³¢|¾Æ±¸Ã¢ ³¯·Á¹ö·Á|¾Þ“³ÀÌ|¾öÃ¢ÇØ|¿ëµÎÁú|ÀÔÃÄ´Ý¾î|Àâ³â|Àç¼·¼­|Àú»¤| ¹ä¾Æ|Á£´Ï|Á¥°¡Æ°|Á¥°°Àº|Á¥±î| ±´Ï| ±¹ä|Á¶ºü¶ó|Á¶»¤|Á·°°ÀÌ|Á¸³ª°Ô|Á¹·Ö|Á¼¹ä|Á½±î|Á½³ª|Á½¹ä|Á¾°£³ª»õ³¢|Á¿°°³×|Á¿°°Àº°Ô|Á¿°°ÀÌ|Á¿±î|Á¿³ª|Á¿¹°|Á¿¹ä|Á¿ºü¶ó|Á¿¿æ| ê³ª|ÁÕ´Ï|Áö¶ö¿°º´|Áö¶ö¿¼º´|Áö¶öÇÏ³×|Ã¢³à°°Àº³â|Ã¢´¤|ÃÕ³â|Æ÷¸£³ë|Çã·¯|È£·Î°°Àº³ð|È£·Î»õ³¢|ÈÄÀåµû|ÈÄÀå»¡¾Æ|È÷¹ã¹Ù|È÷¹ã¹Ù»õ³¢|";

//2008-11-20 Çö¹Î °ü¸®ÀÚ ÇÊÅÍÃß°¡(°ü¸®ÀÚ>±âº»¼³Á¤ µ¿ÀÏÇÏ°Ô ¼öÁ¤ÇØÁà¾ßÇÔ.)
$str_bi = file_get_contents(_DOC_ROOT.'/hosts/'.HOST.'/conf/bi.conf.php');
$backtext .= $str_bi;

$backtext = explode("|",$backtext);

for($ii=0; $ii<count($backtext); $ii++) {
	if(!$backtext[$ii]) continue;
	if(strstr($str_text, $backtext[$ii])) WebApp::moveBack('º»¹®Áß ±ÝÁö¾î('.$backtext[$ii].')°¡ Æ÷ÇÔµÇ¾îÀÖ½À´Ï´Ù. ±ÛÀ» µî·ÏÇÒ¼ö ¾ø½À´Ï´Ù.');

}
}



if(_JUMIN_NO =="Y"){// ÁÖ¹Î¹øÈ£Â÷´Ü


function sidFilter($str, $replace_str) 
{ 
    $pattern = "(([0-9]{6})([-|\| |[:space:]]+)([0-9]{7}))";  //Pattern 
    $result = ereg_replace($pattern, $replace_str, $str); 
    return $result; 
} 
 $str_text = sidFilter($str_text,"******-*******");

}

$_POST['content']= $str_text;

?>