<?
$DB = &WebApp::singleton("DB");


$name[142213] = "태고사";
$name[142214] = "최영장군묘";
$name[142215] = "송포배송";
$name[142216] = "서오릉";
$name[142217] = "서삼릉";
$name[142218] = "북한산성";
$name[142219] = "벽제관리";
$name[142220] = "밤가시초가";
$name[142221] = "공양왕릉";
$name[142222] = "중남미문화원";
$name[142223] = "호수공원";
$name[142224] = "열병합발전소";
$name[142225] = "수자원공사";
$name[142226] = "선인장시험장";
$name[142227] = "농업기술센터";
$name[142228] = "고속철도기지창";
$name[142229] = "하수종말처리장";
$name[142230] = "항공우주박물관";
$name[142231] = "KINTEX";
$name[142232] = "고양세계꽃박람회";
$name[142233] = "행주문화제";
$name[142234] = "꿈돌이과학축제";
$name[142235] = "송포호미걸이";




                          
$nam[142213] = "4";
$nam[142214] = "5";
$nam[142215] = "6";
$nam[142216] = "7";
$nam[142217] = "8";
$nam[142218] = "9";
$nam[142219] = "10";
$nam[142220] = "11";
$nam[142221] = "12";
$nam[142222] = "13";
$nam[142223] = "14";
$nam[142224] = "15";
$nam[142225] = "16";
$nam[142226] = "17";
$nam[142227] = "18";
$nam[142228] = "19";
$nam[142229] = "20";
$nam[142230] = "21";
$nam[142231] = "22";
$nam[142232] = "23";
$nam[142233] = "24";
$nam[142234] = "25";
$nam[142235] = "26";
                          
                          

for($ii=142213; $ii<142235; $ii++) {
	
$nn = $name[$ii];

$nn2 = $nam[$ii];

$sql = "INSERT INTO TAB_MENU ( NUM_OID, NUM_STEP, NUM_MCODE, STR_TITLE, STR_TYPE, NUM_VIEW,
NUM_ENABLE_REMOVE ) VALUES ( 
'$_OID', '$nn2', '$ii', '$nn', 'doc', 1, 1);"; 
$DB->query($sql);
if($DB->commit()){
echo "성공";
}

echo  $sql."<br>";

}
?>